# -*- coding: utf-8 -*-
'''
Created on Mon May 25 15:37:57 2020'''
import numpy as np
number = np.random.randint(1,100)                                # загадали число
print (f"Загадано число от 1 до 99 и равно {number}")
print(number)
def game_core_v2(number):
    '''Функция создает массив чисел от 1 до 100, на каждой итерации делит его на два равных массива
       и проверяет в каком из этих массивов находится число.Действия продолжаются до тех пор ,пока
       массив не будет состоять из одного элемента'''
    ar = [i for i in range(1,100)]                               # cоздаем изначальный список
    count = 0                                                    # устанавливаем счетчик в ноль
    while(len(ar)>1):                                            # запускаем цикл с условием выполнения длины массива больше 1
        
             if number in ar[0 : int(len(ar)/2)]:                # определяем входит ли число в первую половину списка
                 ar = ar[0 : int(len(ar)/2)]                     # перепределяем список
                 count+=1                                        # увеличиваем счетчик на 1
            
             
             else:
                 ar=ar[int(len(ar)/2) : int(len(ar)+1)]          # т.к число входит во вторую половину списка переопределяем его
                 count+=1                                        # увеличиваем сетчик на 1
    print(f"Число угадано с {count} попыток и равно {ar[0]}")
    return(count)                                                # возвращаем значение счетчика если в списке 1 элемент
    

game_core_v2(number)                                             # вызываем функцию с аргументом number


