# -*- coding: utf-8 -*-
'''
Created on Mon May 25 15:37:57 2020'''
import numpy as np
# загадали число
number = np.random.randint(1, 100)
print(f"Загадано число от 1 до 99 и равно {number}")


def game_core_v2(number):
    '''Функция создает массив чисел от 1 до 99, на каждой итерации делит его на два равных массива
       и проверяет в каком из этих массивов находится число.Действия продолжаются до тех пор ,пока
       массив не будет состоять из одного элемента'''
    ar = [i for i in range(
        1, 100)]                               # cоздаем изначальный список
    # устанавливаем счетчик в ноль
    count = 0
    # запускаем цикл с условием выполнения длины массива больше 1
    while len(ar) > 1:

        # определяем входит ли число в первую половину списка
        if number in ar[0: int(len(ar)/2)]:
            # перепределяем список
            ar = ar[0: int(len(ar)/2)]
            count += 1                                        # увеличиваем счетчик на 1

        else:
            # т.к число входит во вторую половину списка переопределяем его
            ar = ar[int(len(ar)/2): int(len(ar)+1)]
            count += 1                                        # увеличиваем сетчик на 1
    print(f"Число угадано с {count} попыток и равно {ar[0]}")
    # возвращаем значение счетчика если в списке 1 элемент
    return(count)


# вызываем функцию с аргументом number
game_core_v2(number)
